<h1 align="center"> 7.2 Data Transformation Part I

<b> Includes:

    * Removing Duplicates
    * Renaming Axis
    * Replacing values
    * Transformation using map

<b>Removing Duplicates

In [1]:
import pandas as pd
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1,1,2,1,3,4,5]})

In [2]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   1
4  one   3
5  two   4
6  two   5

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate or not

In [3]:
data.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
4  one   3
5  two   4
6  two   5

Both of these methods by default consider all of the columns; alternatively,  you  can specify any subset of them to detect duplicates. 

Suppose we had an additional columnof values and wanted to filter duplicates only based on the 'k1' column

In [5]:
data['v1'] = range(7)

In [6]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated and drop_duplicates by default keep the first observed value combina‚Äêtion. 

Passing keep='last' will return the last one

In [7]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   1   3
4  one   3   4
5  two   4   5
6  two   5   6

<b>Transforming Data Using a Function or Mapping

For many datasets, you may wish to perform some transformation based on the val‚Äêues in an array, Series, or column in a DataFrame

    Suppose  you  wanted  to  add  a  column  indicating  the  type  of  animal  that  each  food came  from

In [8]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', \
                              'corned beef', 'Bacon','pastrami', 'honey ham', 
                              'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [9]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [10]:
meat_to_animal = { 
                    'bacon': 'pig',  
                    'pulled pork': 'pig',  
                    'pastrami': 'cow',  
                    'corned beef': 'cow',  
                    'honey ham': 'pig',  
                    'nova lox': 'salmon'
                }

The map method on a Series accepts a function or dict-like object containing a map‚Äêping.

Here we have a small problem in that some of the meats are capitalized and others are not.

In [11]:
lowercased = data['food'].str.lower()

In [12]:
data['animal'] = lowercased.map(meat_to_animal)

In [13]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [14]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

<b>Replacing Values

Map can be used to modify a subset of values inan  object  but  replace  provides  a  simpler  and  more  flexible  way  to  do  so

In [15]:
import numpy as np
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

If  you  want  to  replace  multiple  values  at  once,  you  instead  pass  a  list  and  then  thesubstitute value

In [17]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

To use a different replacement for each value, pass a list of substitutes

In [18]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

The argument passed can also be a dict

In [19]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* The  data.replace  method  is  distinct  from  data.str.replace,which  performs  string  substitution  element-wise.

<b>Renaming Axis Indexes

Axis labels can be similarly transformed by a function or map‚Äêping  of  some  form  to  produce  new,  differently  labeled  objects.

In [20]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [21]:
transform = lambda x: x[:2].upper()

In [22]:
 data.index.map(transform)

Index(['OH', 'CO', 'NE'], dtype='object')

In [23]:
data.index = data.index.map(transform)
data

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
NE    8    9     10    11

If you want to create a transformed version of a dataset without modifying the origi‚Äênal, a useful method is rename

In [24]:
data.rename(index=str.title, columns=str.upper)

    ONE  TWO  THREE  FOUR
Oh    0    1      2     3
Co    4    5      6     7
Ne    8    9     10    11

rename can be used in conjunction with a dict-like object providing new val‚Äêues for a subset of the axis labels

rename  saves  you  from  the  chore  of  copying  the  DataFrame  manually  and  assigningto  its  index  and  columns  attributes

In [25]:
data.rename(index={'OH': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
CO         4    5         6     7
NE         8    9        10    11

Should  you  wish  to  modify  a  dataset  in-place,pass inplace=True.

    data.rename(index={'OHIO': 'INDIANA'}, inplace=True)